/** @file */
#ifndef TRACE_H
#define TRACE_H

//================================================================================================================================
// STRUCT
//================================================================================================================================

/**
*   @brief Структура данных для определения позиции в исходных файлах.
*/
struct source_pos
{
    const char *file;   ///< имя файла
    const char *func;   ///< имя функции
    int         line;   ///< номер строки
};

/**
*   @brief Структура для трассировки стека вызовов.
*/
struct trace
{
    source_pos *stack_trace;    ///< стек вызовов

    size_t      size;           ///< размер  .data
    size_t  capacity;           ///< емкость .data
};

//================================================================================================================================
// FUNCTION DECLARATION
//================================================================================================================================

/**
*   @brief trace ctor.
*/
bool _trace_ctor(trace *const trc);

/**
*   @brief trace dtor.
*/
void _trace_dtor(trace *const trc);

//--------------------------------------------------------------------------------------------------------------------------------

/**
*   @brief Добавляет frame в стек вызовов.
*
*   @param trc  [in][out] - trace to push the frame in
*
*   @param file [in]      - имя файла в точке вызова
*   @param func [in]      - имя функции
*   @param line [in]      - номер строки
*/
bool _trace_push(trace *const trc, const char *const file,
                                   const char *const func,
                                   const int         line);

//--------------------------------------------------------------------------------------------------------------------------------

/**
*   @brief Удаляет frame из стека вызовов.
*
*   @param trc [in] - trace to pop the frame from
*/
void _trace_pop(trace *const trc);

//--------------------------------------------------------------------------------------------------------------------------------

/**
*   @brief Дамп стека вызовов.
*/
void _trace_dump(const trace *const trc);

#endif // TRACE_H